app/Controllers/Akuntansi.php

SELECT *
FROM `tb_akun`
---
    public function index_bukubesar()
    {
        $data = [
            'title' => 'Primer Koperasi Darma Putra Kujang I',
            'sub'   => 'Buku Besar',
            'isi'   => 'pengurus/akuntansi/bukubesar/v_index',
            'akun'  => $this->ModelBukuBesar->findAll()
        ];

SELECT `tanggal`, `no_bukti`, `ket`, `debit`, `kredit`
FROM `tb_jurnal`
WHERE `id_akun` = '2'
AND  `tanggal` LIKE '2024-01%' ESCAPE '!'
SELECT `debit`, `kredit`, `pos_saldo`
FROM `tb_akun`
WHERE `id_akun` = '2'
---
    public function cariData()
    {
        $akunId = $this->request->getPost('akun');
        $bulan = $this->request->getPost('bulan');

        $db = \Config\Database::connect();
        $builder = $db->table('tb_jurnal');
        $builder->select('tanggal, no_bukti, ket, debit, kredit');
        $builder->where('id_akun', $akunId);

        if ($bulan !== 'Semua') {
            $builder->like('tanggal', date('Y') . '-' . $bulan, 'after');
        }

        $query = $builder->get();
        $result = $query->getResultArray();

        // Ambil nilai saldo awal dari tb_akun berdasarkan pos_saldo
        $akunBuilder = $db->table('tb_akun');
        $akunBuilder->select('debit, kredit, pos_saldo');
        $akunBuilder->where('id_akun', $akunId);
        $akunQuery = $akunBuilder->get();