app/Models/ModelSatuan.php

SELECT *
FROM `tb_satuan`
ORDER BY `satuan` ASC
---
    public function allData()
    {
        return $this->db->table('tb_satuan')
            ->orderBy('satuan', 'ASC')
            ->get()->getResultArray();