app/Models/ModelAnggota.php

SELECT *
FROM `tb_anggota`
LEFT JOIN `tb_pangkat` ON `tb_pangkat`.`id_pangkat` = `tb_anggota`.`id_pangkat`
LEFT JOIN `tb_pengurus` ON `tb_pengurus`.`id` = `tb_anggota`.`created_by` OR `tb_pengurus`.`id` = `tb_anggota`.`edited_by`
ORDER BY `tb_anggota`.`nm_anggota` ASC
---
    public function allData()
    {
        return $this->db->table('tb_anggota')
            ->join('tb_pangkat', 'tb_pangkat.id_pangkat = tb_anggota.id_pangkat', 'left')
            ->join('tb_pengurus', 'tb_pengurus.id = tb_anggota.created_by OR tb_pengurus.id = tb_anggota.edited_by', 'left')
            ->orderBy('tb_anggota.nm_anggota', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `tb_anggota`
JOIN `tb_pangkat` ON `tb_pangkat`.`id_pangkat` = `tb_anggota`.`id_pangkat`
---
    public function getAnggota()
    {
        return $this->db->table($this->table)
            ->join('tb_pangkat', 'tb_pangkat.id_pangkat = tb_anggota.id_pangkat')
            ->get()
            ->getResultArray();