app/Models/ModelAkunHeader.php

SELECT *
FROM `tb_akun_header`
LEFT JOIN `tb_pengurus` ON `tb_pengurus`.`id` = `tb_akun_header`.`created_by` OR `tb_pengurus`.`id` = `tb_akun_header`.`edited_by`
ORDER BY `tb_akun_header`.`nm_akun` ASC
---
    public function allData()
    {
        return $this->db->table('tb_akun_header')
            ->join('tb_pengurus', 'tb_pengurus.id = tb_akun_header.created_by OR tb_pengurus.id = tb_akun_header.edited_by', 'left')
            ->orderBy('tb_akun_header.nm_akun', 'ASC')
            ->get()->getResultArray();