app/Models/ModelAkun.php

    public function allData()
    {
        return $this->db->table('tb_akun')
            ->join('tb_pengurus', 'tb_pengurus.id = tb_akun.created_by OR tb_pengurus.id = tb_akun.edited_by', 'left')
            ->orderBy('kd_akun', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_akun`
LEFT JOIN `tb_pengurus` ON `tb_pengurus`.`id` = `tb_akun`.`created_by` OR `tb_pengurus`.`id` = `tb_akun`.`edited_by`
ORDER BY `kd_akun` ASC