app/Models/ModelAgen.php

SELECT *
FROM `tb_agen`
LEFT JOIN `tb_pengurus` ON `tb_pengurus`.`id` = `tb_agen`.`created_by` OR `tb_pengurus`.`id` = `tb_agen`.`edited_by`
ORDER BY `tb_agen`.`nm_agen` ASC
---
    public function allData()
    {
        return $this->db->table('tb_agen')
            ->join('tb_pengurus', 'tb_pengurus.id = tb_agen.created_by OR tb_pengurus.id = tb_agen.edited_by', 'left')
            ->orderBy('tb_agen.nm_agen', 'ASC')
            ->get()->getResultArray();

SELECT MAX(`kd_agen`) AS `kd_agen`
FROM `tb_agen`
---
    public function getMaxId()
    {
        $query = $this->db->table('tb_agen')->selectMax('kd_agen');
        $result = $query->get()->getRowArray();