app/Models/ModelPengurus.php

SELECT *
FROM `tb_pengurus`
WHERE `id_pengurus` = 'admin'
---
    public function login($username)
    {
        return $this->db->table('tb_pengurus')->where('id_pengurus', $username)
            ->get()
            ->getRowArray();