app/Models/ModelPenjualan.php

    public function cekBarang($kd_barang)
    {
        return $this->db->table('tb_barang')
            ->select('tb_barang.*, tb_barang.created_at AS barang_created_at, tb_barang.created_by AS barang_created_by, tb_barang.edited_at AS barang_edited_at, tb_barang.edited_by AS barang_edited_by')
            ->select('tb_pengurus.*')
            ->select('tb_agen.*, tb_agen.created_at AS agen_created_at, tb_agen.created_by AS agen_created_by, tb_agen.edited_at AS agen_edited_at, tb_agen.edited_by AS agen_edited_by')
            ->select('tb_satuan.*')
            ->join('tb_pengurus', 'tb_pengurus.id = tb_barang.created_by OR tb_pengurus.id = tb_barang.edited_by', 'left')
            ->join('tb_agen', 'tb_agen.id_agen = tb_barang.id_agen', 'left')
            ->join('tb_satuan', 'tb_satuan.id_satuan = tb_barang.id_satuan', 'left')
            ->where('kd_barang', $kd_barang)
            ->get()->getRowArray();
---
SELECT `tb_barang`.*, `tb_barang`.`created_at` AS `barang_created_at`, `tb_barang`.`created_by` AS `barang_created_by`, `tb_barang`.`edited_at` AS `barang_edited_at`, `tb_barang`.`edited_by` AS `barang_edited_by`, `tb_pengurus`.*, `tb_agen`.*, `tb_agen`.`created_at` AS `agen_created_at`, `tb_agen`.`created_by` AS `agen_created_by`, `tb_agen`.`edited_at` AS `agen_edited_at`, `tb_agen`.`edited_by` AS `agen_edited_by`, `tb_satuan`.*
FROM `tb_barang`
LEFT JOIN `tb_pengurus` ON `tb_pengurus`.`id` = `tb_barang`.`created_by` OR `tb_pengurus`.`id` = `tb_barang`.`edited_by`
LEFT JOIN `tb_agen` ON `tb_agen`.`id_agen` = `tb_barang`.`id_agen`
LEFT JOIN `tb_satuan` ON `tb_satuan`.`id_satuan` = `tb_barang`.`id_satuan`
WHERE `kd_barang` = 'BRG00001'

    public function cekStok($kd_barang, $qty)
    {
        $barang = $this->db->table('tb_barang')
            ->select('stok')
            ->where('kd_barang', $kd_barang)
            ->get()->getRowArray();
---
SELECT `stok`
FROM `tb_barang`
WHERE `kd_barang` = 'BRG00001'