app/Models/ModelAngsuran.php

    public function allData()
    {
        return $this->db->table('tb_angsuran')
            ->join('tb_pinjaman', 'tb_pinjaman.id_pinjaman = tb_angsuran.id_pinjaman', 'left')
            ->join('tb_anggota', 'tb_anggota.id_anggota = tb_pinjaman.id_anggota', 'left')
            ->orderBy('tb_angsuran.tgl_bayar', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_angsuran`
LEFT JOIN `tb_pinjaman` ON `tb_pinjaman`.`id_pinjaman` = `tb_angsuran`.`id_pinjaman`
LEFT JOIN `tb_anggota` ON `tb_anggota`.`id_anggota` = `tb_pinjaman`.`id_anggota`
ORDER BY `tb_angsuran`.`tgl_bayar` DESC