app/Models/ModelAkun.php

    public function allData()
    {
        return $this->db->table('tb_akun')
            ->orderBy('kd_akun', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tb_akun`
ORDER BY `kd_akun` ASC